src/cf/InformationRegisters/НастройкиУчетаУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаУСН</Name>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПризнаватьДоходОтКомиссионераНаДатуОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает значения настроек по умолчанию на указанный период, если их нет
//
// Параметры:
//  Период	 - Дата
//
Процедура УстановитьНачальныеНастройкиУчета(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиУчетаУСНСрезПоследних.Период КАК Период,
	|	НастройкиУчетаУСНСрезПоследних.ПризнаватьДоходОтКомиссионераНаДатуОтчета КАК ПризнаватьДоходОтКомиссионераНаДатуОтчета
	|ИЗ
	|	РегистрСведений.НастройкиУчетаУСН.СрезПоследних(&Период, ) КАК НастройкиУчетаУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НоваяЗапись = СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = НачалоКвартала(Период);
		НоваяЗапись.ПризнаватьДоходОтКомиссионераНаДатуОтчета = Истина;
		НоваяЗапись.Записать();
	КонецЕсли;				
	
КонецПроцедуры

// Обработчик обновления - включает признание дохода по дате документа Отчет комиссионера с 01.01.2024,
// если в базе есть организации на УСН
//
Процедура ВключитьПризнаниеДоходаНаДатуОтчетаКомиссионера() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиУчетаУСН.Период КАК Период,
	|	НастройкиУчетаУСН.ПризнаватьДоходОтКомиссионераНаДатуОтчета КАК ПризнаватьДоходОтКомиссионераНаДатуОтчета
	|ИЗ
	|	РегистрСведений.НастройкиУчетаУСН КАК НастройкиУчетаУСН";

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаДействия = Дата(2024, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(СистемыНалогообложенияОрганизаций.Период) КАК Период
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
	|ГДЕ
	|	СистемыНалогообложенияОрганизаций.ПлательщикУСН";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	ПериодЗаписи = Неопределено;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Период) Тогда
		ПериодЗаписи = Макс(Выборка.Период, ДатаНачалаДействия);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодЗаписи) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		НаборЗаписей = СоздатьНаборЗаписей();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ПериодЗаписи;
		НоваяЗапись.ПризнаватьДоходОтКомиссионераНаДатуОтчета = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось выполнить процедуру ""РегистрыСведений.НастройкиУчетаУСН.ВключитьПризнаниеДоходаНаДатуОтчетаКомиссионера"" по причине:
					|%1'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.НастройкиУчетаУСН,
			,
			ТекстСообщения);
	
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
